perf-local/k6-mixed-baseline.txt


  █ THRESHOLDS 

    http_req_duration{scenario:readers}
    ✗ 'p(95)<800' p(95)=810.12ms

    http_req_duration{scenario:senders}
    ✗ 'p(95)<1500' p(95)=1.73s

    http_req_failed{scenario:readers}
    ✓ 'rate<0.02' rate=0.00%

    http_req_failed{scenario:senders}
    ✗ 'rate<0.05' rate=5.06%


  █ TOTAL RESULTS 

    checks_total.......: 19886  91.904085/s
    checks_succeeded...: 98.80% 19649 out of 19886
    checks_failed......: 1.19%  237 out of 19886

    ✓ read ok
    ✗ send ok
      ↳  94% — ✓ 4444 / ✗ 237

    HTTP
    http_req_duration..............: avg=172.39ms min=2.41ms  med=15.3ms   max=2.7s  p(90)=386.75ms p(95)=1.45s   
      { expected_response:true }...: avg=171.76ms min=3.91ms  med=15.38ms  max=2.7s  p(90)=377.85ms p(95)=1.45s   
      { scenario:readers }.........: avg=113.7ms  min=3.91ms  med=10.84ms  max=2.51s p(90)=118.09ms p(95)=810.12ms
      { scenario:senders }.........: avg=363.03ms min=2.41ms  med=84.09ms  max=2.7s  p(90)=1.49s    p(95)=1.73s   
    http_req_failed................: 1.19%  237 out of 19886
      { scenario:readers }.........: 0.00%  0 out of 15205
      { scenario:senders }.........: 5.06%  237 out of 4681
    http_reqs......................: 19886  91.904085/s

    EXECUTION
    iteration_duration.............: avg=1.93s    min=304.5ms med=317.44ms max=9.2s  p(90)=6.61s    p(95)=6.98s   
    iterations.....................: 19886  91.904085/s
    vus............................: 1      min=1            max=230
    vus_max........................: 230    min=230          max=230

    NETWORK
    data_received..................: 117 MB 541 kB/s
    data_sent......................: 5.9 MB 27 kB/s



time="2026-07-08T08:18:54Z" level=error msg="thresholds on metrics 'http_req_duration{scenario:readers}, http_req_duration{scenario:senders}, http_req_failed{scenario:senders}' have been crossed"