perf-local/k6-mixed-phase2-control.txt


  █ THRESHOLDS 

    http_req_duration{scenario:readers}
    ✗ 'p(95)<800' p(95)=1.77s

    http_req_duration{scenario:senders}
    ✗ 'p(95)<1500' p(95)=2.13s

    http_req_failed{scenario:readers}
    ✓ 'rate<0.02' rate=0.00%

    http_req_failed{scenario:senders}
    ✓ 'rate<0.05' rate=4.70%


  █ TOTAL RESULTS 

    checks_total.......: 17456  80.361391/s
    checks_succeeded...: 98.81% 17250 out of 17456
    checks_failed......: 1.18%  206 out of 17456

    ✓ read ok
    ✗ send ok
      ↳  95% — ✓ 4175 / ✗ 206

    HTTP
    http_req_duration..............: avg=352.92ms min=2.34ms   med=27.18ms  max=2.82s p(90)=1.65s    p(95)=1.87s
      { expected_response:true }...: avg=351.86ms min=4.18ms   med=27.03ms  max=2.82s p(90)=1.65s    p(95)=1.87s
      { scenario:readers }.........: avg=183.19ms min=4.18ms   med=16.25ms  max=2.82s p(90)=229.29ms p(95)=1.77s
      { scenario:senders }.........: avg=859.47ms min=2.34ms   med=572.18ms max=2.79s p(90)=1.86s    p(95)=2.13s
    http_req_failed................: 1.18%  206 out of 17456
      { scenario:readers }.........: 0.00%  0 out of 13075
      { scenario:senders }.........: 4.70%  206 out of 4381
    http_reqs......................: 17456  80.361391/s

    EXECUTION
    iteration_duration.............: avg=2.2s     min=304.33ms med=333.32ms max=9.29s p(90)=7.77s    p(95)=8.16s
    iterations.....................: 17456  80.361391/s
    vus............................: 3      min=3            max=230
    vus_max........................: 230    min=230          max=230

    NETWORK
    data_received..................: 103 MB 474 kB/s
    data_sent......................: 5.2 MB 24 kB/s



time="2026-07-08T09:32:16Z" level=error msg="thresholds on metrics 'http_req_duration{scenario:readers}, http_req_duration{scenario:senders}' have been crossed"